<?php namespace App\Models;

class Helper
{
    public static function softVersionFromStringToInt($string) {
        $soft_version = explode(".", $string);

        if (! isset($soft_version[0], $soft_version[1], $soft_version[2])) {
            return false;
        }

        return $soft_version = $soft_version[0] . sprintf('%02d', $soft_version[1]) . sprintf('%02d', $soft_version[2]);
    }

    public static function softVersionFromIntToString($int) {
        $minor2 = substr($int, -2, 2);
        $minor1 = substr($int, -4, 2);
        $major = substr($int, 0, -4);
        return (int) $major . '.' . (int)$minor1 . '.' . (int)$minor2;
    }

    private static $genitivus = array(
        'саша' => 'Саши',

        'александра' => 'Aлександры',
        'алекса' => 'Алексы',
        'анастасия' => 'Анастасии',
        'юлия' => 'Юлии',
        'мария' => 'Марии',
        'анна' => 'Анны',
        'екатерина' => 'Екатерины',
        'виктория' => 'Виктории',
        'кристина' => 'Кристины',
        'ольга' => 'Ольги',
        'ирина' => 'Ирины',
        'елена' => 'Елены',
        'татьяна' => 'Татьяны',
        'светлана' => 'Светланы',
        'настя' => 'Насти',
        'ксения' => 'Ксении',
        'дарья' => 'Дарьи',
        'алина' => 'Алины',
        'наталья' => 'Натальи',
        'марина' => 'Марины',
        'евгения' => 'Евгении',
        'валерия' => 'Валерии',
        'катя' => 'Кати',
        'даша' => 'Даши',
        'аня' => 'Ани',
        'полина' => 'Полины',
        'яна' => 'Яны',
        'юля' => 'Юли',
        'диана' => 'Дианы',
        'карина' => 'Карины',
        'алена' => 'Алены',
        'алёна' => 'Алёны',
        'елизавета' => 'Елизаветы',
        'маша' => 'Маши',
        'маргарита' => 'Маргариты',
        'наташа' => 'Наташи',
        'катерина' => 'Катерины',
        'оля' => 'Оли',
        'софья' => 'Софьи',
        'софия' => 'Софии',
        'наталия' => 'Наталии',
        'натали' => 'Натали',

        'александр' => 'Aлександра',
        'сергей' => 'Сергея',
        'дмитрий' => 'Дмитрия',
        'андрей' => 'Андрея',
        'алексей' => 'Алексея',
        'евгений' => 'Евгения',
        'максим' => 'Максима',
        'денис' => 'Дениса',
        'антон' => 'Антона',
        'роман' => 'Романа',
        'илья' => 'Ильи',
        'иван' => 'Ивана',
        'никита' => 'Никиты',
        'игорь' => 'Игоря',
        'дима' => 'Димы',
        'павел' => 'Павла',
        'олег' => 'Олега',
        'владимир' => 'Владимира',
        'кирилл' => 'Кирилла',
        'михаил' => 'Михаила',
        'николай' => 'Николая',
        'артём' => 'Артема',
        'руслан' => 'Руслана',
        'виталий' => 'Виталия',
        'владислав' => 'Владислава',
        'вадим' => 'Вадима',
        'влад' => 'Влада',
        'константин' => 'Константина',
        'егор' => 'Егора',
        'стас' => 'Стаса',
        'станислав' => 'Станислава',
    );

    private static $casusInstrumentalis = array(
        'саша' => 'Сашей',

        'александра' => 'Александрой',
        'алекса' => 'Алексой',
        'анастасия' => 'Анастасией',
        'юлия' => 'Юлией',
        'мария' => 'Марией',
        'анна' => 'Анной',
        'екатерина' => 'Екатериной',
        'виктория' => 'Викторией',
        'кристина' => 'Кристиной',
        'ольга' => 'Ольгой',
        'ирина' => 'Ириной',
        'елена' => 'Еленой',
        'татьяна' => 'Татьяной',
        'светлана' => 'Светланой',
        'настя' => 'Настей',
        'ксения' => 'Ксенией',
        'дарья' => 'Дарьей',
        'алина' => 'Алиной',
        'наталья' => 'Натальей',
        'марина' => 'Мариной',
        'евгения' => 'Евгенией',
        'валерия' => 'Валерией',
        'катя' => 'Катей',
        'даша' => 'Дашей',
        'аня' => 'Аней',
        'полина' => 'Полиной',
        'яна' => 'Яной',
        'юля' => 'Юлей',
        'диана' => 'Дианой',
        'карина' => 'Кариной',
        'алена' => 'Аленой',
        'алёна' => 'Алёной',
        'елизавета' => 'Елизаветой',
        'маша' => 'Машей',
        'маргарита' => 'Маргаритой',
        'наташа' => 'Наташей',
        'катерина' => 'Катериной',
        'оля' => 'Олей',
        'софья' => 'Софьей',
        'софия' => 'Софией',
        'наталия' => 'Наталией',
        'натали' => 'Натали',

        'александр' => 'Александром',
        'сергей' => 'Сергеем',
        'дмитрий' => 'Дмитрием',
        'андрей' => 'Андреем',
        'алексей' => 'Алексеем',
        'евгений' => 'Евгением',
        'максим' => 'Максимом',
        'денис' => 'Денисом',
        'антон' => 'Антоном',
        'роман' => 'Романом',
        'илья' => 'Ильей',
        'иван' => 'Иваном',
        'никита' => 'Никитой',
        'игорь' => 'Игорем',
        'дима' => 'Димой',
        'павел' => 'Павлом',
        'олег' => 'Олегом',
        'владимир' => 'Владимиром',
        'кирилл' => 'Кириллом',
        'михаил' => 'Михаилом',
        'николай' => 'Николаем',
        'артём' => 'Артемом',
        'руслан' => 'Русланом',
        'виталий' => 'Виталием',
        'владислав' => 'Владиславом',
        'вадим' => 'Вадимом',
        'влад' => 'Владом',
        'константин' => 'Константином',
        'егор' => 'Егором',
        'стас' => 'Стасом',
        'станислав' => 'Станиславом',
    );

    public static function casusInstrumentalis($name, $sex) {
        $nameL = mb_strtolower($name);
        return isset(self::$casusInstrumentalis[$nameL]) ? self::$casusInstrumentalis[$nameL] : $name;
    }

    public static function genitivus($name, $sex) {
        $nameL = mb_strtolower($name);
        return isset(self::$genitivus[$nameL]) ? self::$genitivus[$nameL] : $name;
    }

    public static function closeDBConnections()
    {
        \DB::disconnect();
        \DB::connection('logs')->disconnect();
    }

};
